src/DataProcessors/РасширенныйПоискМатериалов/РасширенныйПоискМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасширенныйПоискМатериалов</name>
  <attributes>
    <name>ГруппаМатериалов</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>НайденнаяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/РасширенныйПоискМатериалов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Реквизит Из Метаданные.Справочники.Найти("Материалы").СтандартныеРеквизиты Цикл
	ТЧ = ТаблицаРеквизитов.Добавить();
	ТЧ.Реквизит = Реквизит.Имя;
	ТЧ.Синоним = Реквизит.Имя;	
	КонецЦикла;
		Для Каждого ОбщРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		ОбщийРеквизит = ОбщРеквизит.Состав.Найти(Метаданные.Справочники.Найти("Материалы"));
			Если ОбщийРеквизит <> Неопределено Тогда 
				Если ОбщийРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				ТЧ = ТаблицаРеквизитов.Добавить();
				ТЧ.Реквизит = ОбщРеквизит.Имя;
				ТЧ.Синоним = ОбщРеквизит.Имя;	
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла; 
			Для каждого Реквизит Из Метаданные.Справочники.Найти("Материалы").Реквизиты Цикл
			ТЧ = ТаблицаРеквизитов.Добавить();	
			ТЧ.Реквизит = Реквизит.Имя;
			ТЧ.Синоним = Реквизит.Синоним;	
			КонецЦикла;
КонецПроцедуры

&НаСервере
Функция УдовлетворяетКритериямПоиска(ЭлементСправочника)
	Для каждого ТЧ Из ТаблицаРеквизитов Цикл
		Если ТЧ.Пометка Тогда
			Если Найти(ВРег(ЭлементСправочника[ТЧ.Реквизит]),ВРег(СокрЛП(Объект.СтрокаПоиска))) > 0 Тогда	
			Возврат(ЭлементСправочника[ТЧ.Реквизит]);
			КонецЕсли; 
		КонецЕсли;  	
	КонецЦикла;
Возврат(Неопределено);
КонецФункции 

&НаСервере
Процедура НайтиМатериалыНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.ЭтоГруппа = ЛОЖЬ";
	Если Не Объект.ГруппаМатериалов.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И Материалы.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Объект.ГруппаМатериалов);
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Материалы.Наименование";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НайденнаяСтрока = УдовлетворяетКритериямПоиска(ВыборкаДетальныеЗаписи.Ссылка);
		Если НайденнаяСтрока <> Неопределено Тогда
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
		ТЧ.НайденнаяСтрока = НайденнаяСтрока;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НайтиМатериалы(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	НайтиМатериалыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ТекФорма = ПолучитьФорму("Справочник.Материалы.ФормаСписка");
ТекФорма.Открыть();
ТекФорма.Элементы.Список.ТекущаяСтрока = Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ;
КонецПроцедуры
